app/controllers/school_classes_controller.rb

    def show
        @school = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @school = SchoolClass.new(post_params(:title, :room_number))
        @school.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Physics"], ["room_number", 10]]

    def update
        @school = SchoolClass.find(params[:id])
        @school.update(post_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 11], ["id", 2]]

    def edit
        @school = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]