app/controllers/students_controller.rb

    def update
        @student = Student.find(params[:id])
        @student.update(post_params(:first_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Scary Cary"], ["updated_at", "2021-04-07 22:36:44.193738"], ["id", 3]]